app/Controllers/BookController.php

    public function index()
    {

        $bookModel = new BookModel();
        $publisherModel = new PublisherModel();
        $languageModel = new LanguageModel();
        $genreModel = new GenreModel();
        $subGenreModel = new SubGenreModel();
        $authorModel = new AuthorModel();
        $roleModel = new RoleModel();
        $serieModel = new SerieModel();

        $db = Database::connect();
        $formats = $db->table('format')->get()->getResult();

        $books = $bookModel->getBooksWithPublisherNameAndAuthors();
        $publishers = $publisherModel->where('status', 1)->orderBy('publisherName', 'ASC')->findAll();
        $languages = $languageModel->findAll();
        $genres = $genreModel->where('status', 1)->findAll();
        $subgenres = $subGenreModel->where('status', 1)->findAll();
        $authors = $authorModel->where('status', 1)->orderBy('authorName', 'ASC')->findAll();
        $roles = $roleModel->orderBy('roleName', 'ASC')->findAll();
        $series = $serieModel->orderBy('serieName', 'ASC')->findAll();
---
SELECT *
FROM `format`
SELECT *
FROM `publisher`
WHERE `status` = 1
ORDER BY `publisherName` ASC
SELECT *
FROM `language`
SELECT *
FROM `genre`
WHERE `status` = 1
SELECT *
FROM `subgenre`
WHERE `status` = 1
SELECT *
FROM `author`
WHERE `status` = 1
ORDER BY `authorName` ASC
SELECT *
FROM `role`
ORDER BY `roleName` ASC
SELECT *
FROM `serie`
ORDER BY `serieName` ASC

    public function editBook($id)
    {
        $bookModel      = new BookModel();
        $authorModel    = new AuthorModel();
        $publisherModel = new PublisherModel();
        $languageModel  = new LanguageModel();
        $genreModel     = new GenreModel();
        $subGenreModel  = new SubGenreModel();
        $roleModel      = new RoleModel();
        $serieModel     = new SerieModel();

        $db = \Config\Database::connect();
        $formats = $db->table('format')->get()->getResult();

        $book = $bookModel->getBookById($id);
        if (!$book) {
            return redirect()->to('/books')->with('error', 'Le livre n\'existe pas');
        }

        $data = [
            'meta_title'    => 'Édition du livre',
            'book'          => $book,
            'listofauthors' => $authorModel->where('status', 1)->orderBy('authorName', 'ASC')->findAll(),
            'publishers'    => $publisherModel->where('status', 1)->orderBy('publisherName', 'ASC')->findAll(),
            'languages'     => $languageModel->findAll(),
            'genres'        => $genreModel->where('status', 1)->findAll(),
            'subgenres'     => $subGenreModel->where('status', 1)->findAll(),
            'roles'         => $roleModel->orderBy('roleName', 'ASC')->findAll(),
            'series'        => $serieModel->orderBy('serieName', 'ASC')->findAll(),
---
SELECT *
FROM `format`
SELECT *
FROM `author`
WHERE `status` = 1
ORDER BY `authorName` ASC
SELECT *
FROM `publisher`
WHERE `status` = 1
ORDER BY `publisherName` ASC
SELECT *
FROM `language`
SELECT *
FROM `genre`
WHERE `status` = 1
SELECT *
FROM `subgenre`
WHERE `status` = 1
SELECT *
FROM `role`
ORDER BY `roleName` ASC
SELECT *
FROM `serie`
ORDER BY `serieName` ASC