app/Controllers/DashboardController.php

    public function index()
    {
        if (!session()->get('is_logged_in'))
        {
            return redirect()->to('/auth')->with('errors', 'Vous devez être connecté.');
        }

        $allowedRoles = ['Administrator', 'Contributor'];
        if (!in_array(session()->get('user_role'), $allowedRoles)) {
            return redirect()->to('/')->with('errors', 'Accès refusé.');
        }

        $userModel = new UserModel();
        $publisherModel = new PublisherModel();
        $languageModel = new LanguageModel();
        $roleModel = new RoleModel();
        $genreModel = new GenreModel();
        $subGenreModel = new SubGenreModel();
        $labelModel = new LabelModel();

        $users = $userModel->findAll();
        $publishers = $publisherModel->findAll();
        $languages = $languageModel->findAll();
        $roles = $roleModel->findAll();
        $genres = $genreModel->findAll();
        $subgenres = $subGenreModel->getSubgenresWithGenres();
        $labels = $labelModel->findAll();
---
SELECT *
FROM `user`
SELECT *
FROM `publisher`
SELECT *
FROM `language`
SELECT *
FROM `role`
SELECT *
FROM `genre`
SELECT *
FROM `label`