app/Controllers/SerieController.php

    public function index()
    {
        $serieModel = new SerieModel();

        $data['series'] = $serieModel->where('status', 1)
                                      ->orderBy('serieName', 'ASC')
                                      ->findAll();
---
SELECT *
FROM `serie`
WHERE `status` = 1
ORDER BY `serieName` ASC

    public function getSerieDetails($id)
    {
        $serieModel = new SerieModel();
        $serie = $serieModel->find($id);
---
SELECT *
FROM `serie`
WHERE `serie`.`id` = '4'