app/Controllers/SubGenreController.php

SELECT *
FROM `subgenre`
WHERE `subgenre`.`id` = '6'
---
    public function updateSubGenre()
    {
        $subGenreId = $this->request->getPost('subgenreId');
        $field = $this->request->getPost('field');
        $newValue = $this->request->getPost('newValue');

        $subGenreModel = new SubGenreModel();
        $validationErrors = $subGenreModel->validateSubGenreRules($field, $newValue);

        if ($validationErrors !== true) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Erreur de validation',
                'errors'  => $validationErrors
            ]);
        }

        $subGenre = $subGenreModel->find($subGenreId);