app/Models/AuthModel.php

SELECT *
FROM `user`
WHERE `email` = 'iarl_dalan@hotmail.com'
 LIMIT 1
---
    public function authenticate($email, $password) {
        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();