app/Models/BookModel.php

    public function getBooksWithPublisherNameAndAuthors()
    {
        $books = $this->select('book.*, publisher.publisherName, author.authorName, role.roleName, language.languageName, language.abbreviation,
                                serie.serieName, bookserie.volume, genre.genreName, subgenre.subgenreName, book.isbn, book.format')
                        ->join('publisher', 'publisher.id = book.publisher')
                        ->join('bookauthor', 'bookauthor.book = book.id')
                        ->join('author', 'author.id = bookauthor.author')
                        ->join('role', 'role.id = bookauthor.role')
                        ->join('language', 'language.abbreviation = book.language', 'left')
                        ->join('bookserie', 'bookserie.book = book.id', 'left')
                        ->join('serie', 'serie.id = bookserie.serie', 'left')
                        ->join('bookgenre', 'bookgenre.book = book.id', 'left')
                        ->join('genre', 'genre.id = bookgenre.genre', 'left')
                        ->join('booksubgenre', 'booksubgenre.book = book.id', 'left')
                        ->join('subgenre', 'subgenre.id = booksubgenre.subgenre', 'left')
                        ->findAll();
---
SELECT `book`.*, `publisher`.`publisherName`, `author`.`authorName`, `role`.`roleName`, `language`.`languageName`, `language`.`abbreviation`, `serie`.`serieName`, `bookserie`.`volume`, `genre`.`genreName`, `subgenre`.`subgenreName`, `book`.`isbn`, `book`.`format`
FROM `book`
JOIN `publisher` ON `publisher`.`id` = `book`.`publisher`
JOIN `bookauthor` ON `bookauthor`.`book` = `book`.`id`
JOIN `author` ON `author`.`id` = `bookauthor`.`author`
JOIN `role` ON `role`.`id` = `bookauthor`.`role`
LEFT JOIN `language` ON `language`.`abbreviation` = `book`.`language`
LEFT JOIN `bookserie` ON `bookserie`.`book` = `book`.`id`
LEFT JOIN `serie` ON `serie`.`id` = `bookserie`.`serie`
LEFT JOIN `bookgenre` ON `bookgenre`.`book` = `book`.`id`
LEFT JOIN `genre` ON `genre`.`id` = `bookgenre`.`genre`
LEFT JOIN `booksubgenre` ON `booksubgenre`.`book` = `book`.`id`
LEFT JOIN `subgenre` ON `subgenre`.`id` = `booksubgenre`.`subgenre`

    public function getBookById($id)
    {
        $builder = $this->select('
            book.*,
            publisher.publisherName, publisher.id as publisherId,
            author.authorName, author.id as authorId,
            role.roleName,
            language.languageName, language.abbreviation,
            serie.serieName, serie.id as serieId,
            bookserie.volume,
            genre.genreName, genre.id as genreId,
            subgenre.subgenreName, subgenre.id as subgenreId,
            book.isbn,
            book.format
        ')
        ->join('publisher', 'publisher.id = book.publisher')
        ->join('bookauthor', 'bookauthor.book = book.id')
        ->join('author', 'author.id = bookauthor.author')
        ->join('role', 'role.id = bookauthor.role')
        ->join('language', 'language.abbreviation = book.language', 'left')
        ->join('bookserie', 'bookserie.book = book.id', 'left')
        ->join('serie', 'serie.id = bookserie.serie', 'left')
        ->join('bookgenre', 'bookgenre.book = book.id', 'left')
        ->join('genre', 'genre.id = bookgenre.genre', 'left')
        ->join('booksubgenre', 'booksubgenre.book = book.id', 'left')
        ->join('subgenre', 'subgenre.id = booksubgenre.subgenre', 'left')
        ->where('book.id', $id);

        $rows = $builder->get()->getResult();
---
SELECT `subgenre`
FROM `booksubgenre`
WHERE `book` = '20'
SELECT `book`.*, `publisher`.`publisherName`, `author`.`authorName`, `role`.`roleName`, `language`.`languageName`, `language`.`abbreviation`, `serie`.`serieName`, `bookserie`.`volume`, `genre`.`genreName`, `subgenre`.`subgenreName`, `book`.`isbn`, `book`.`format`
FROM `book`
JOIN `publisher` ON `publisher`.`id` = `book`.`publisher`
JOIN `bookauthor` ON `bookauthor`.`book` = `book`.`id`
JOIN `author` ON `author`.`id` = `bookauthor`.`author`
JOIN `role` ON `role`.`id` = `bookauthor`.`role`
LEFT JOIN `language` ON `language`.`abbreviation` = `book`.`language`
LEFT JOIN `bookserie` ON `bookserie`.`book` = `book`.`id`
LEFT JOIN `serie` ON `serie`.`id` = `bookserie`.`serie`
LEFT JOIN `bookgenre` ON `bookgenre`.`book` = `book`.`id`
LEFT JOIN `genre` ON `genre`.`id` = `bookgenre`.`genre`
LEFT JOIN `booksubgenre` ON `booksubgenre`.`book` = `book`.`id`
LEFT JOIN `subgenre` ON `subgenre`.`id` = `booksubgenre`.`subgenre`
WHERE `book`.`id` = '30'
 LIMIT 1

    public function getBooksByAuthor($authorId)
    {
        $builder = $this->db->table($this->table);
        $builder->select('Book.id, Book.title, Book.publication, Role.roleName');
        $builder->join('BookAuthor', 'Book.id = BookAuthor.book');
        $builder->join('Role', 'BookAuthor.role = Role.id');
        $builder->where('BookAuthor.author', $authorId);
        $query = $builder->get();
---
SELECT `Book`.`id`, `Book`.`title`, `Book`.`publication`, `Role`.`roleName`
FROM `book`
JOIN `BookAuthor` ON `Book`.`id` = `BookAuthor`.`book`
JOIN `Role` ON `BookAuthor`.`role` = `Role`.`id`
WHERE `BookAuthor`.`author` = '9'

    public function getBooksBySerie($serieId)
    {
        $builder = $this->db->table($this->table);
        $builder->select('Book.id, Book.title, Book.publication, BookSerie.volume');
        $builder->join('BookSerie', 'Book.id = BookSerie.book');
        $builder->where('BookSerie.serie', $serieId);
        $query = $builder->get();
---
SELECT `Book`.`id`, `Book`.`title`, `Book`.`publication`, `BookSerie`.`volume`
FROM `book`
JOIN `BookSerie` ON `Book`.`id` = `BookSerie`.`book`
WHERE `BookSerie`.`serie` = '4'

    public function getRecentBooks()
    {
        $date30DaysAgo = date('Y-m-d', strtotime('-30 days'));
        $today = date('Y-m-d');

        return $this->where('publication >=', $date30DaysAgo)
                    ->where('publication <=', $today)
                    ->where('status', 1)
                    ->findAll();
---
SELECT *
FROM `book`
WHERE `publication` >= '2025-01-14'
AND `publication` <= '2025-02-13'
AND `status` = 1

    public function getUpcomingBooks()
    {
        $today = date('Y-m-d');
        $date30DaysLater = date('Y-m-d', strtotime('+30 days'));

        return $this->where('publication >', $today)
                    ->where('publication <=', $date30DaysLater)
                    ->where('status', 1)
                    ->findAll();
---
SELECT *
FROM `book`
WHERE `publication` > '2025-02-13'
AND `publication` <= '2025-03-15'
AND `status` = 1