app/Models/BookModel.php

SELECT *
FROM `book`
WHERE `book`.`id` = '20'
---
    public function updateBook($bookId, array $data)
    {
        $validation = \Config\Services::validation();
        // Utilisez les règles et messages dédiés à l'édition
        $validation->setRules(\App\Validation\EditBookValidation::$EditBookRules, \App\Validation\EditBookValidation::$EditBookMessages);
        if (!$validation->run($data)) {
            // Retourne immédiatement les erreurs de validation
            return ['validation' => false, 'errors' => $validation->getErrors()];
        }

        $db = $this->db;
        $db->transStart();

        // Récupérer l'entité actuelle
        $currentEntity = $this->find($bookId);

UPDATE `book` SET `title` = 'A Power Unbound', `format` = 'Broché'
WHERE `book`.`id` IN ('20')
---

        // Mise à jour de la table principale si des changements sont détectés
        if (!empty($changedData)) {
            if (!$this->update($bookId, $changedData)) {

SELECT `author`, `role`
FROM `bookauthor`
WHERE `book` = '20'
---
        // --- Mise à jour des relations ---

        // 1. Mise à jour des auteurs principaux et acteurs dans la table "bookauthor"
        $currentRelations = $this->db->table('bookauthor')
            ->select('author, role')
            ->where('book', $bookId)
            ->get()
            ->getResultArray();

SELECT *
FROM `bookserie`
WHERE `book` = '20'
---
        }

        // 2. Mise à jour de la table "bookserie" (série et volume)
        $currentSerie = $this->db->table('bookserie')
            ->where('book', $bookId)
            ->get()
            ->getRowArray();

SELECT `genre`
FROM `bookgenre`
WHERE `book` = '20'
---
        }

        // 3. Mise à jour de la table "bookgenre" (genres)
        $currentGenresResult = $this->db->table('bookgenre')
            ->select('genre')
            ->where('book', $bookId)
            ->get()
            ->getResultArray();

SELECT `book`.*, `publisher`.`publisherName`, `publisher`.`id` as `publisherId`, `author`.`authorName`, `author`.`id` as `authorId`, `role`.`roleName`, `language`.`languageName`, `language`.`abbreviation`, `serie`.`serieName`, `serie`.`id` as `serieId`, `bookserie`.`volume`, `genre`.`genreName`, `genre`.`id` as `genreId`, `subgenre`.`subgenreName`, `subgenre`.`id` as `subgenreId`, `book`.`isbn`, `book`.`format`
FROM `book`
JOIN `publisher` ON `publisher`.`id` = `book`.`publisher`
JOIN `bookauthor` ON `bookauthor`.`book` = `book`.`id`
JOIN `author` ON `author`.`id` = `bookauthor`.`author`
JOIN `role` ON `role`.`id` = `bookauthor`.`role`
LEFT JOIN `language` ON `language`.`abbreviation` = `book`.`language`
LEFT JOIN `bookserie` ON `bookserie`.`book` = `book`.`id`
LEFT JOIN `serie` ON `serie`.`id` = `bookserie`.`serie`
LEFT JOIN `bookgenre` ON `bookgenre`.`book` = `book`.`id`
LEFT JOIN `genre` ON `genre`.`id` = `bookgenre`.`genre`
LEFT JOIN `booksubgenre` ON `booksubgenre`.`book` = `book`.`id`
LEFT JOIN `subgenre` ON `subgenre`.`id` = `booksubgenre`.`subgenre`
WHERE `book`.`id` = '20'
---
    public function getBookById($id)
    {
        // Permet de récupérer toutes les informations d'un livre en fonction de son ID
        $builder = $this->select('
            book.*,
            publisher.publisherName, publisher.id as publisherId,
            author.authorName, author.id as authorId,
            role.roleName,
            language.languageName, language.abbreviation,
            serie.serieName, serie.id as serieId,
            bookserie.volume,
            genre.genreName, genre.id as genreId,
            subgenre.subgenreName, subgenre.id as subgenreId,
            book.isbn,
            book.format
        ')
        ->join('publisher', 'publisher.id = book.publisher')
        ->join('bookauthor', 'bookauthor.book = book.id')
        ->join('author', 'author.id = bookauthor.author')
        ->join('role', 'role.id = bookauthor.role')
        ->join('language', 'language.abbreviation = book.language', 'left')
        ->join('bookserie', 'bookserie.book = book.id', 'left')
        ->join('serie', 'serie.id = bookserie.serie', 'left')
        ->join('bookgenre', 'bookgenre.book = book.id', 'left')
        ->join('genre', 'genre.id = bookgenre.genre', 'left')
        ->join('booksubgenre', 'booksubgenre.book = book.id', 'left')
        ->join('subgenre', 'subgenre.id = booksubgenre.subgenre', 'left')
        ->where('book.id', $id);

        $rows = $builder->get()->getResult();