app/Models/BookModel.php

    public function getRecentBooks()
    {
        $date30DaysAgo = date('Y-m-d', strtotime('-30 days'));
        $today = date('Y-m-d');

        return $this->where('publication >=', $date30DaysAgo)
                    ->where('publication <=', $today)
                    ->where('status', 1)
                    ->findAll();
---
SELECT *
FROM `book`
WHERE `publication` >= '2025-01-13'
AND `publication` <= '2025-02-12'
AND `status` = 1