app/Models/LabelModel.php

SELECT *
FROM `label`
WHERE `id` IN ('AU70','AU71','AU72','AU73','AU74','AU75','PU2','GE1','GE2')
---
    public function getLabelsByIds(array $labelIds)
    {
        return $this->whereIn('id', $labelIds)->findAll();