app/Models/LabelSubscriptionModel.php

    public function toggleSubscription($userId, $labelId)
    {
        // Déduit le type de label à partir du préfixe (on extrait les 2 premiers caractères)
        $prefix = substr($labelId, 0, 2);
        switch ($prefix) {
            case 'AU':
                $entity = "cet auteur";
                break;
            case 'PU':
                $entity = "cet éditeur";
                break;
            case 'SE':
                $entity = "cette série";
                break;
            case 'GE':
                $entity = "ce genre";
                break;
            case 'SG':
                $entity = "ce sous-genre";
                break;
            default:
                $entity = "ce label";
        }

        // Recherche d'une souscription existante
        $subscription = $this->where('user', $userId)
                             ->where('label', $labelId)
                             ->first();
---
SELECT *
FROM `LabelSubscription`
WHERE `user` = '1'
AND `label` = 'PU1'
 LIMIT 1

                ];
            } else {
                // Il était désabonné, on réactive la souscription
                $this->update($subscription->id, ['status' => 1]);
---
UPDATE `LabelSubscription` SET `status` = 1
WHERE `LabelSubscription`.`id` IN ('9')

                'label'  => $labelId,
                'status' => 1
            ];
            if ($this->insert($data)) {
---
INSERT INTO `LabelSubscription` (`user`, `label`, `status`) VALUES ('1', 'PU1', 1)

    public function isSubscribed($userId, $labelId)
    {
        $subscription = $this->where('user', $userId)
                             ->where('label', $labelId)
                             ->first();
---
SELECT *
FROM `LabelSubscription`
WHERE `user` = '1'
AND `label` = 'AU70'
 LIMIT 1

    public function getUserLabelSubscriptions($userId)
    {
        $builder = $this->db->table('LabelSubscription as ls');
        $builder->select('ls.id as subscriptionId, ls.label, l.labelName, ls.status');
        $builder->join('label as l', 'l.id = ls.label');
        $builder->where('ls.user', $userId);
        $builder->where('ls.status', 1);
        $query = $builder->get();
---
SELECT `ls`.`id` as `subscriptionId`, `ls`.`label`, `l`.`labelName`, `ls`.`status`
FROM `LabelSubscription` as `ls`
JOIN `label` as `l` ON `l`.`id` = `ls`.`label`
WHERE `ls`.`user` = '15'
AND `ls`.`status` = 1