app/Models/SubGenreModel.php

    public function updateSubGenre($subGenreId, $field, $newValue)
    {
        if (empty($subGenreId) || !is_numeric($subGenreId)) {
            log_message('error', 'ID du sous-genre invalide');
            return false;
        }

        if (!in_array($field, $this->allowedFields)) {
            log_message('error', 'Champ invalide: ' . $field);
            return false;
        }

        $data = [
            $field => $newValue
        ];

        log_message('debug', 'Mise à jour du sous-genre (ID: ' . $subGenreId . ') avec les données: ' . json_encode($data));

        $updated = $this->where('id', $subGenreId)->set($data)->update();
---
UPDATE `subgenre` SET `status` = '0'
WHERE `id` = '6'

    public function getGenresForSubgenre($subGenreId)
    {
        return $this->select('GROUP_CONCAT(genre.genreName SEPARATOR ", ") as genres')
                    ->join('GenreSubgenre', 'GenreSubgenre.subgenre = subgenre.id', 'left')
                    ->join('genre', 'GenreSubgenre.genre = genre.id', 'left')
                    ->where('subgenre.id', $subGenreId)
                    ->groupBy('subgenre.id')
                    ->findAll();
---
SELECT GROUP_CONCAT(genre.genreName SEPARATOR ", ") as genres
FROM `subgenre`
LEFT JOIN `GenreSubgenre` ON `GenreSubgenre`.`subgenre` = `subgenre`.`id`
LEFT JOIN `genre` ON `GenreSubgenre`.`genre` = `genre`.`id`
WHERE `subgenre`.`id` = '1'
GROUP BY `subgenre`.`id`

    public function getSubgenresWithGenres()
    {
        $subgenres = $this->findAll();
---
SELECT *
FROM `subgenre`